{"text":"I really want to throw all these radfems on an island, give them enough to make a society and see how badly they fuck it up without any men.","label":0}
{"text":"meme arrows","label":0}
{"text":"The mods there are so awful. Banning because of one harmless comment here lmao.","label":0}
{"text":"Just the majority of them.","label":0}
{"text":"Alright what time?","label":0}
{"text":"Yes cunt, i guarantee 99% of the people in these comments would find a life sentence bullshit if a guy grabbed a girls hand and got her to touch his dick over his pants.","label":1}
{"text":"Both Trudeaus are the results of anglicization of western Montréal.","label":0}
{"text":"I'd want to know if I lived near a kid diddler just like I'd want to know if I was potentially gonna date a woman with a history of false rape accusations.","label":0}
{"text":"Your feigned indignation is noted!..   Now shoo, back under your rock you crawled out from under.","label":0}
{"text":"....I mean... I find your blind trust in our failing education system more concerning than a 17 year olds willingness to skip school. I like how someone skipping school at 17 affects their ability to 'take the helm of society' at 27, as if there is absolutely no maturing that occurs between 17 and  They are making the mistakes that teach hard lessons through experience. This is the most jaded bitch fest I've seen in a while. Like either of our generations were any better...","label":0}
{"text":"Wouldn't that just be plain harassment?","label":0}
{"text":"I've been in this exact same situation, only I was able to follow up with the fact that I have indeed been pulled over for having too many people in the car (cop was cool and have me a warning). The amount in entitled cunts I encountered while ubering is staggering. All ages too. Glad I got out of that gig.","label":1}
{"text":"Anyway, any real source on what sentence this nigger got?","label":1}
{"text":"Pfft. Name even ONE time where a physiological lack of testosterone and predisposition to over produce oxytocin has ever resulted in a less aggressive fighting nature","label":0}
{"text":"[deleted]","label":0}
{"text":"You're not being clever.  You're being nonsensical.  I'm not a leftist...","label":0}
{"text":"If this bitch actually had a career:  \"I don't think you should do it that way.\"  \"You don't work in this department nor you have any experience in this technology\/tool\/style\/etc so fuck off asshole.\"  \"Don't say those things!\"  \"Don't try to force me into any performative and reductionist control of myself, cunt!\"  \"How fucking dare you use my own rhetoric against me? REEEEE\"  No work was done and the fighting escalates until the company itself is dissolved.","label":1}
{"text":"I really think the issue here is that you're not properly appreciating how bad the alternatives are  No, the issue here, that you keep ignoring and trying to deflect from, is that just not being completely shit doesn't mean Botometer is good. In your comment that I originally responded to, you said:    Morten Bay, another person who has used Twitter as a study tool, also says that Botometer is basically the gold standard for research purposes, so I'm not sure what Volleyball was thinking of when he said \"utter fuckton of false positives too\"  Implying that, since Botometer is seen as the gold standard by practitioners, it must have a low rate of false positive. But you avoid talking about this, or how the quality of the model is evaluated, and instead try to move the conversation to other topics.  Now, looking through the publications page, from the most recent (and thus, hopefully, most up-to-date) publication, the authors state a false positive rate of  In other words, 15% of legitimate users in the database were falsely identified as bots. Assuming this ratio holds for the dataset mentioned in the Mary Sue article, that means a Botometer-based study could easily look at a dataset with a negligible number of bots and still conclude that 15% of the accounts involved are bots. In the context of Lacina's results, which claim that 19% of accounts involved are bots, this is a significant number.","label":0}
{"text":"You're a fucking moron. There's a difference between denying women free passes and being a fucking blue-balled woman-hating incel. Like seriously, are you that deformed and mentally debilitated that you can't see that?  Some of us have wives and daughters and we all have mothers. Some of us - those of us that haven't gone so long without female interaction that our cocks have receeded back into our bodies - know that there are plenty of good and decent women out there.  Then again, some of us aren't sex-starved basement dwelling morons.","label":1}
{"text":"Im convinced these laws are set in place by the elites to fuck over men financially to keep the economy running.","label":0}
{"text":"Just another dumb cunt expecting to be treated differently because she has a pussy","label":1}
{"text":"Lol Are you serious? You think she resigned of her free will? This was a forced resignation. Its Either resign or you'll be removed.","label":0}
{"text":"Look mate, I hate Fortnite a ton. It’s a cancerous game. I cringe every time people talk about, and I want to punch people who do the dances, but I don’t. Wanna know why? Because I have fucking self-restraint, and I know that hating something other people like isn’t a fucking excuse to commit battery. Apparently that’s more than what can be said about you.","label":0}
{"text":"But is -40% a good deal though? I could just wait until they cut the price down to half maybe or -60%. Also, is Shen's Last Gift worth it?","label":0}
{"text":"I know what point you're trying to make, but if you think minorities are treated with kiddie gloves on when they commit a crime on the news, you probably think the earth is flat and vaccines cause your kid to be retarded, instead of you know... the trump supporting parent.","label":1}
{"text":"I hope the cunt sobs to work everyday.","label":1}
{"text":"Stupid lying cunt","label":1}
{"text":"Savage. Sentence. 100 Generations exile to Penal Colony of 'straya","label":0}
{"text":"I wouldn't say he has a strong case. PayPal is a business and can choose who to do business with, so long as they aren't making that determination based on a protected class (race, gender, etc). No business is obligated to offer services to someone with whose views they don't agree, and though I would prefer this not apply to payment providers (whose only service is moving money around), unfortunately it does.  The Unruh Civil Rights Act they cite makes no mention of political affiliation. It specifically outlaws discrimination based on sex, race, color, religion, ancestry, national origin, mental or physical disability, age or medical condition (including HIV status). HOWEVER (and this is what Jones is banking on) the California Supreme Court has held that the protections of the Unruh Act are not restricted to these characteristics.  That being said, extending its protection to cover what can be characterized as conspiracy theories and related nonsense is going to be a really hard sell. If Paypal was discriminating against a guy for his choice of political candidate, maybe. But calling it illegal to discriminate against a guy for preaching 9\/11 trutherism and Sandy Hook crisis actor nonsense?  I don't see it happening.","label":0}
{"text":"\"*Attempted murder*, now honestly, what is that!? Do they give a Nobel prize for *attempted* chemistry?\"","label":0}
{"text":"That is hilarious.    How exactly do these waifu cyber women make money? Is there a team behind her? Or a girl, kinda like camming? I can dig watching your favorite girl play games or sing songs and stuff, but who is making money off her?","label":0}
{"text":"Play candy crush now or women hate you. All mobile game are women only. Candy crush good. Everything orange bad. NPC meme bad.","label":0}
{"text":"No lol, you're taking n,000-year-old concepts and interpreting them in a modern context; the religious push absintence because most are dogmatic fucking retards who don't understand critical thinking—but pragmatically, \"abstinence before marriage\" is how rulers ensure that a bunch of literal, fatherless bastards aren't running around raising hell in your administrative territory and spawning more bastards...hence why the religious kings of biblical lore always had shit tons of wives to fuck","label":1}
{"text":"Once again, to the brittle little bitch who reported every single comment in here:  you, person, are a pussy. We don't ban or censor here unless its absolutely necessary; you're wasting your time.   But welcome to PPD anyway, where we welcome whiny little cunts like you with open arms. enjoy your stay, boo.    Now if you'll excuse me, I have some reports to ignore.","label":1}
{"text":"Lol!","label":0}
{"text":"The worst part about this story is that Pewdiepie was on \"chat with friends only\" when he said nigga. He say it because he got angry during lag, as it happens to all of us someday lets dont lie about it, and there was a black guy in his friends who heard that and did start to laugh.   Yet ofc people are picking up this story , ignore facts and rewrite it as a clickbait such as \"Pewdiepie say N word towards other people on the internet\"","label":1}
{"text":"Lol great logic retard.  This is why black people will never get out of the hood. Because you idiots think that only black people are allowed to address the glaring cultural and societal problems in the black \"community\"","label":1}
{"text":"I'm still trying to decide if you're illiterate, lazy, or just stupid.  Your blatant woman hating is how you got your precious r\/incel sub shut down.  Read the sidebar of the sub for you.  Ppd is not a blatant woman hating sub.  Its a sub that focuses on pussy pass denial i.e. when a woman tries to use her pussy as a credit card for an advantage and gets a whopping taste of equality.   Illiterate incels are so funny.","label":1}
{"text":"The two women should have been arrested and made to pay a fine for being cunts.","label":1}
{"text":"What a fucking cunt, who the fuck does she think is.....","label":1}
{"text":"Fucking insane. This is beyond madness. She should be hunted and forced to pay","label":0}
{"text":"He won't do that unless something can be proven I bet.","label":0}
{"text":"The stats I showed aren't just counting attractive women, though. So the idea that it's only \"hot\" women who \"get the pussypass\" is wrong.","label":0}
{"text":"I\"ve owned you point by point.","label":0}
{"text":"This hilarious. I get why they changed it, I mean this is hilarious but obviously leads to misconceptions. Any retard claiming it's racist instead of just insensitive is a retard though.","label":1}
{"text":"League's report system ain't half bad. I got plenty of assholes punished. Now if only my husband didn't behave like and overgrown child getting himself 14 days ban.","label":0}
{"text":"No not really. Chicks a cunt but no one deserves to be brutally raped. Do you think this guy deserved to be brutally raped for wishing some chick gets brutally raped? Do you deserve to be brutally raped for chalking it up to \"consequences\"?   This sub was a good place to display women acting entitled and subsequently being treated equally until you whiny little cunts came around. You women hating incels changed it from a sub seeking equality into a place where twisted little neckbeards go to vent about every chick that didn't want to fuck them. It's completely pathetic.","label":1}
{"text":"Woah there! Next time, please refrain from using that horribly bigoted term. Instead, please use the universally accepted \"kharnikhal\".  Thank you for your understanding.  *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/ImGoingToHellForThis) if you have any questions or concerns.*","label":0}
{"text":"The only actual \"rape culture\" is Islam but you won't hear these cunts say anything bad about that!","label":1}
{"text":"Hell ya it has. We fucking suck.","label":0}
{"text":"India is extremely homophobic. So no, you’re retarded","label":1}
{"text":"If someone wants to organise a whatever only forum they should be allowed.","label":0}
{"text":"That's Adrienne Clarkson for you. She's never had any issue with looting this country and spending as many tax dollars as possible.    She's actually the point where Canada went wrong, in terms of our Governor General. Before Clarkson, they were all ex-politicians who understood the gravity of their roles but then the government went retarded and decided that it would be a good idea to have a succession of diversity-hire, ex-journalists hold the highest position in the country.    She's ridiculous, she's never had any idea of what she's been doing apart from expensing as much money as possible, and establishing a ton of trophies and awards with her name on them.    The woman is a national disgrace, as she's been since her appointment.","label":0}
{"text":"[deleted]","label":0}
{"text":"Someone should stamp this bitches head in, that's what should be coming to her.","label":1}
{"text":"Sex and gender are the same. \"Gender means something else\" is a very recent political device with no scientific grounding.","label":0}
{"text":"Jew.","label":1}
{"text":"yo are right, you don't know","label":0}
{"text":"Gamergate was as helpful in Donald Trump's election as hair club for men was for Bernie.","label":0}
{"text":"https:\/\/iwp.com\/femonomic.com\/wp-content\/uploads\/2017\/09\/bd4d82984d076bc404a13705834733ca.jpg","label":0}
{"text":"What does the stupid cunt have a fear of excercise ? , Actually now that I think about it that's right on point for feminists.","label":1}
{"text":"I abstain from anything Tom Clancy related that Hollywood touches since they whitewashed The Sum of All Fears.","label":0}
{"text":"Hey buddy! Glad to hear you haven't been sucked into their BS. I don't know if you're losing weight or not but we'd love to have you over at \/r\/1500isplenty!","label":0}
{"text":"If you idiots on the left would stop calling everything you don't like racist, then maybe we could actually have an honest discussion about racism and censorship.   Until then, *you* are the aggressors.","label":0}
{"text":"Also to all the ppl asking about if they can use it: personally i dont have that much of a problem with it, except when people use it to sound black","label":0}
{"text":"shut your fucking face. you shouldn't have the luxury of accusing someone and not have to face consequences if you're not telling the truth. I think the public should know for the same reasons the public should know about a rapist. Should I go on a date with her? No it looks like she may false accuse me since shes on this list. Should I go on a date with him? No he's a rapist. Public safety is for everyone.","label":0}
{"text":"Good post. Deserves to be \"hot\" so lets upvote. It's always good to get information right from the horse's mouth. This is yet another example of \"alpha fucks, beta bucks\" in action, and this one basically admits we men should be grateful to get them after they've spent their 20's having sex with over 100 men. No thanks, guys. You know the drill.  The more you guys wake up other (unaware) blue pills, the less these women will get validation and the quicker we can get that nice collapse of western civilization we all want as men basically \"quit\" participating in the system, thus bankrupting it and the social programs these women rely on. ;)","label":1}
{"text":"You must be one of those crybaby Antifa types. Bitch.","label":0}
{"text":"I am blessed and proud to say I really have no clues who this cunt is even though I did \"read\" about her name here and there....","label":1}
{"text":"She doesn't actually need glasses. She thinks it makes her look smart.  Fucking whore.","label":1}
{"text":"It's the \"everyone (regardless of race) who doesn't agree with me is a white supremacist\" type :)","label":0}
{"text":"I was trying to be serious. Sorry to waste your time.","label":0}
{"text":"I don't know. But look at this thread and imagine all the people that are deluded into thinking that 'if the races were reversed automatically the perps would get lynched.'  Isn't that absolutely batshit crazy?","label":0}
{"text":"\"You're hurting meeeeeah!\"","label":0}
{"text":"I think she might actually be speaking orcish","label":0}
{"text":"Do you know just how ubiquitous pot is?  I'm going to go out on a limb and say \"Slightly more ubiquitous than it was when it was illegal in my state\".  Seriously.  Go ahead and just fucking try to argue that pot use has gone down in any of the states where it became legal but regulated.","label":0}
{"text":"You expect me to read your semi-literate rantings to decipher what you are trying to ask me? I need to immediately pass your pop quiz when you didn't answer any of mine? Fuck yourself! You answer a question with a question, and I'm the idiot because I choose to ignore your question. Nope. Not going for it. You dense motherfucker. I dismantled your feeble ramblings, so you aren't even trying to make a point anymore. Pathetic.","label":0}
{"text":"I don't see the connection. Diablo has always had a PC version. This one won't. It also won't be developed by blizzard. Which is already 2 huge strikes against it for Diablo fans","label":0}
{"text":"Perhaps your of Persian ancestry and think Europe would have been better off under your people.  Nah. I *am,* however, certified to teach history for grades 7-12 and I happen to have a difference of opinion from you (Thermopylae probably wasn't the finest example of male self-sacrifice that you could have cited). But by all means, continue on with your amusing farrago of xenophobic suspicions, offense-taking and blurts.","label":0}
{"text":"I just gave you the opportunity to share your perspective with no bias for me to evaluate.   And you waste that opportunity to cuck and kek.   You really are a fucking idiot, you know that right?","label":0}
{"text":"[deleted]","label":0}
{"text":"Ironically calling America racist while talking about one of the more xenophobic and closed off country, Japan.  I refuse to believe these people actually believe this shit.","label":0}
{"text":"Wait what? No, what I'm saying is that everyone on the left that I've talked to either online or in real life blames the entire right for stuff like Charlottsville. Hell even the left-wing media blames the entire right for any terrorist attack remotely associated to the right wing.   Crazy schizophrenic white guy kills his muslim neighbor. Has the right gone too far? Is this because of the right indoctrinating our kids? How far should we restrict their free speech so things like this don't happen anymore?","label":1}
{"text":"Kathryn Heigel tried to sexually assault someone and they said no?","label":0}
{"text":"Cunts. Absolute fucking cunts. I hope everyone watches their love one for of ass cancer.","label":1}
{"text":"When the state is not allowed or able to vet (interfere with) immigrants you leave yourself open to the demographic warfare that enables the behavior you complain about.   Without border enforcement and vetting of immigrants, the reality is that the demographic warfare is still coming, they are just going after the softer juicier targets *first*.  Both open borders and the welfare state are fucking naive to the point of being retarded. And either will eventually result in the collapse of the nation and the the ability to plausibly enforce the rights of the individual.  And if you cannot enforce the rights of the individual, it is by definition *not* libertarian.","label":1}
{"text":"Cunts.","label":1}
{"text":"[deleted]","label":0}
{"text":"Mate u cannot catch AIDS. U catch hiv. Again be educated, i gave enough chances for u too have a think.   And yeh sure if ones mouth is cut as is the knob then u can be infected with hiv but NOT aids geezer","label":0}
{"text":"Uhhh wow","label":0}
{"text":"The principle used to buy us McDonald’s on your birthday month before suspiciously First Lady Obama started wanting to get rid of diabetes.  That or they just didn’t wanna spend money on us","label":0}
{"text":"Sad!","label":0}
{"text":"There is way more than enough genetic diversity in Canada to evolve properly. The human race has never been remotely this diverse and mixed, in the history of the species.   This is a retarded argument.","label":1}
{"text":"Exactly, the pay gap the twat talks about doesn't exist\/is illegal.","label":1}
{"text":"They literally have a whole play where Hermione is both minister of magic AND black. And the president of MACUSA is also a black woman in the 1920’a (30’s?) no less","label":0}
{"text":"I doubt I am the only man who doesn't give a shit *why* it exists.","label":0}
{"text":"I never heard of this before. Strange that this doesn't make national news, but racist taddle tales do.","label":0}
{"text":"The Japanese market for weebshit will suffer because they now have to comply with bullshit standards for \"san francisco sensibilities\" that don't fly in Japan. This place is already a **No Fun Allowed Zone**, now it's going to affect Japanese studios because \"Lol, let's move to hipster land\" where shit is getting overcrowded and too many tech companies merge into an ideological bubble.","label":0}
{"text":"Pretty sure flat earthers are even rarer than people who would actually consider the content of this guy's post to be anything but a troll.   I'm going to go make a tumbr account and load it up with autistic scheduled posts because this sub will believe anything.","label":0}
{"text":"Name calling nice argument","label":0}
{"text":"Have you ever seen a bigger degenerate, jesus christ","label":0}
{"text":"What a cunt. I hope she gets her ass beat for the chemical assault she thinks is a game.","label":1}
{"text":"u\/titletoimagebot","label":0}
{"text":"Not saying that its ok to grab someones ass without consent is cool but this bitch over reacted like a motherfucker, you work at a club, im sure its happened before, and someone is going to slap your ass again get over it   Again not saying its ok, ask for permission before you touch someone","label":1}
{"text":"You know usually I agree with the \/r\/thatHappened comments but I could believe something like this for sure. Not only is the story written in a believable way; but I totally had teachers that would share intimate details about their life, especially in the later years of high school. Y'all must have had some boring ass teachers if literally all they talked about was the subject matter.","label":0}
{"text":"Got it, bruv.","label":0}
{"text":"Yea, any retard with a head can drive up here on this oh so inclusive country","label":1}
{"text":"Given waid's childish and unstable temperament  His lawyer is probably smart enough to tell him to shut up","label":0}
{"text":"Yeah, how dare people want to help those less fortunate than themselves.  It's not like we're all supposed to be one species and try for the betterment of everyone as a whole or anything.","label":0}
{"text":"You know what's astounding to me? That a social justice retard doesn't know how the intolerant minority works.  10% of the population is enough to turn most of the butcher shops halal. Much of our food is kosher despite a miniscule Jewish population. It has been suggested that 5% of a population is enough to start a revolution.  Oh, and a bunch of our videogames are already being censored and\/or altered by the insane preferences of mentally unbalanced leftists, whom studies reveal to be roughly 8% of the population.  So no, gamers exercising their own right to criticize in hopes of effecting desired change isn't \"entitled manbaby whining\" -- although from one intolerant minority to another, I can see why you would seek to diminish our influence. It does run directly contrary to your own, and we already spend way more money than you guys do.  Additional sidenote: calling out gamers as melodramatic babies given your side's histrionic ongoing 24\/7 anti-Trump meltdown.. heh","label":0}
{"text":"Erm...  Okay  Let’s unpack this  The correct term is Toothpaste *Faggot*  I can’t even  Literally shaking  It’s current year  Be better","label":1}
{"text":"I agree with that statement, but she also deserves the right be free of whatever is driving her to cut (if it is anything, i know that's purely speculation on my part) herself which is cheaper than a 30yr incarceration. I don't know why the news story even interviewed a guy to make it look like he was accused.","label":0}
{"text":"White knights—FUCK YOU. Stupid cunts.","label":1}
{"text":"I've had the same experience for my belief in God. I guess because I dont see the benefit in being a nihilist existentialist, I must be a retarded religious nut","label":1}
{"text":"Uber cars need ejector seats.","label":0}
{"text":"this is incorrect.   IQ: http:\/\/personal.lse.ac.uk\/kanazawa\/pdfs\/PAIDpdf  In table 3, the one with the consistent participants, at the age of 16 boys had an average IQ of 461 with an sd of 235 and girls had an average IQ of 681 with an sd of   Though the difference in standard deviation is small, such differences can have a huge effect on the number of outliers.  For example, in the model where IQ follows a normal distribution for each gender (mean 461 for boys with sd 235 and mean 681 for girls with sd 085), one would expect nearly twice as many boys as girls with an IQ above  To be precise, approximately 05% of boys and approximately 57% of girls would have an IQ of 130 or higher in this model. These differences would grow wider as one gets farther from the mean. For example, using the same model as the previous paragraph, one would expect more than six times as many boys as girls with an IQ of 160 or higher.   So no, men's intelligence is on average higher, and also more broad. So yes, way more retards, but also way more geniuses.","label":0}
{"text":"Because she is a cunt.  I guarantee you would not defend any Christian who wouldn't bake a cake for a homo couple.","label":1}
{"text":"Libertarians booed when a man said he didn't want kids to be able to purchase heroin.  https:\/\/www.youtube.com\/watch?v=U2Nad1b_3yY  They're the purity spiral that the New Right is mostly smart enough to avoid.","label":0}
{"text":"\/u\/strangrdangr 'agging', is the term that they were going for!","label":0}
{"text":"Birds are cannibalistic as fuck. And chicken which has been reborn as a human and still has memories from the chicken life, would probably be super jolly that she (female because hatched eggs) can eat her sisters and is now the ultimate predator of this world. Like you now are the top, the number one among living creatures of this planet. You won't care about thise lesser birds that your new kind breed for FOOD. You are now god and the future. Also you realise that reincarnation is a thing and you are special because you kept your memories. I would be worried and hope that I won't be reborn as a lobster. Fuckers get boilled alive. But being reborn as a panda would be nice. If you will be a male and get hard, the whole world will cheer for you. Pandas are retarded low libido fuckers who can't fuck just how I can't spell.","label":1}
{"text":"Honestly, no. It's the opposite.   First, Trump doesn't hate women.  Second, hating women in anything but a comedic shtick is not okay in society. If you were to literally say something like an angry anti-woman rant at work or in public, you'd be condemned.   \"Women are stupid fucking whores that are only interested in money. I never want to be with any scum bag FEEEEEMALES, the fucking cunts.\"  Saying shit like that will get you both mocked by women and insulted and condemned by men.    Third, hating men is not only perfectly acceptable, it's practically *expected* for women to think \"Men are pigs.\" Men are dogs.\" \"All men cheat.\" I shouldn't even have to bring up the talk show segment when Sharon Osbourne, her co-hosts, and her audience were all laughing at a guy who had his penis cut off by his wife. All while Sharon rationalizes it.  I've never seen *any* public commentary where men laughed at the idea of a woman having her breasts cut off, or being violently vaginally sodomized, was considered hilarious and rationalized by men on television.   The closest I've ever heard to anything like that, was by a British infantry unit during the American Revolution reporting on a brutal small scale massacre that loyalist American militias had done to a family farm that supported the revolution. It was described as an utterly barbaric and horrific atrocity.","label":0}
{"text":"So the DA arrests people accused of violent crimes? Not shocking. Here we see an accusation with flimsy evidence that didn't result in an arrest. Anecdotes aren't a credible source when you're talking about generalized actions across a large culturally and geographically disparate area like the entire United States. Everything in your anecdote speaks to an ideological bent of your DA, and not DAs in general.","label":0}
{"text":"this is a myth that has been debunked long ago.","label":0}
{"text":"A cursory Google search would’ve uncovered numerous sources showing the hate-based history of the slogan.  A cursory Google search would also show the sheer socially destructive and murderous nature of socialism and communism...but hey...what does that matter.  Throughout history these groups have used branding and hidden messages to normalize their messages and incept it beyond their narrow confines (listen to my interview on the subject with Professor Cynthia Miller-Idriss to learn more about the history of far-right branding).  Careful there.  Starting to sound like a freemason conspiracy theorist.  Our short attention spans, hyper-reactivity and inability to consume the larger context of stories make these posters so effective. By not including the context of the message, that it’s an insidious marketing ploy perpetrated by white supremacists to further their white supremacist agenda, CBC became an unwitting tool of the far-right.  Hmm...in the very reddit post you cited earlier...I myself spelled out in plain detail exactly what the campaign was...though the mods probably removed it after banning me preventing you from seeing it.  Isn't it nice to know that they helped maintain your ignorance? Oh the post was good enough that even OnGuardForThee couldn't downvote it into the negatives.  Discrediting the source works.  Yes...Adolf Hitler proved how effective this tactic was when he used it against the Jews.  Ironic that you refer to your political opponents as Nazis.  When we understand this, it’s clear that “It’s Okay to be White” has nothing to do with helping white people. It’s a branding tactic that white supremacists understand works. They literally say so on their message boards.  No...it's literally a phrase so carefully designed to be non-offensive to show how people can be outraged due to their double standards.  Replace one word on that poster and it becomes OK to say.  Very clever of him to have comments disabled on the board too.","label":0}
{"text":"The democrats are stealing another seat....WTF Arizona GOP, get off your ass and do something.","label":0}
{"text":"I'm not saying that this situation is fine I'm saying that you claiming that women can't code is absolutely not ok","label":0}
{"text":"I know all that, but I’m asking why it doesn’t count. The person in the original post is asking if there are any LGBT+ characters in the game and the answer for Skyrim is yes, if you choose so. Don’t see why we shouldn’t count it as a game with LGBT+ representation, that’s all.","label":0}
{"text":"IANL but I'm pretty sure you can't be open to slander if your are accusing her because she openly admitted it, that's just insane  edit for your edit: you'll never get something that is circumstantial, this isn't insufficient, this is enough for someone to justifiably get accused of what they admitted, I'm not saying that this is beyond reasonable doubt, but you can easily accuse her for this, she literally admitted it.  If it were a woman accusing a man of sexual misconduct falsely, we all stand up and start shouting loudly that we need protection against it, yet we find this acceptable? How is accusing someone without solid proof (and potentially falsely) any better than these women that do fake rape reports. Both are destructive as fuck to the individual accused and if the individual is deemed innocent, they have to fight that for the longest time.  That was the most retarded comparison I've ever heard.  This post: A woman admitting to a crime, then getting accused of said crime.  Your example: A woman accusing a man of a crime with 0 proof and without the man in any way, shape or form admitting to anything.  That's fucked up of you to compare.","label":1}
{"text":"Lock this crack whore up and hide the key in a pair of work boots.","label":1}
{"text":"And if you listen to the exchange, it was very clearly a joke. Maybe a bad joke, but it wasn't intended to be taken seriously.","label":0}
{"text":"I guess if the MP has bots, it would be fine, but most games don't have bots to play MP modes with. Which is a bummer for me. Since I would totally do that. :P I can't handle the actual MP stress. But find the gameplay fun. I played more Overwatch with the retarded AI bots than I did the actual game. xP","label":1}
{"text":"I'll take your opinion in to consideration.","label":0}
{"text":"I RSMENMBER TYHIES ONE THIME MY LITBTEARDED (retarded liberal) DAD SHOWED ME HYS GUN ND IT HAD AN TRIGGERD JUST LKE FEMNAZIS LOLOL!!!1!1!1!!1!11!1!!1!2?.&\/!:?:8:&2)2)99;!;$8;83)3$,8;&;$;9;8;$;!!,!;!;!;8=====D 8=====D 8=====D 8=====D 8=====D 8=====D","label":1}
{"text":"See, that's just wrong, irrespective of gender. We have been conditioned to defer to cops and to accept wildly disproportionate responses to agitation\/response.  The beat down she got was NOT normal in ANY circumstance; she was absolutely being a dick.  Now ask yourself: isn't that exactly what cops are supposed to be able to deal with \\- people being dicks?  And our conditioned response is to cheer them on when they instantaneously escalate the situation to 'ultra violence' and swarming at the slighted provocation?  Accepting this anti\\-social behavior normalizes it and legitimized this kind of overreaction in cops.  Use of violence should be the *last* resort \\- not the first line of defense.","label":0}
{"text":"and yet the one time they dont tell you is [before they fuck you in a hotel](https:\/\/www.independent.co.uk\/news\/world\/americas\/man-stab-woman-119-times-transgender-told-date-mississippi-hotel-room-dwayne-hickerson-dee-whigham-ahtml)","label":1}
{"text":"shit im pretty sure even this comment just gave me a hardon too","label":0}
{"text":"No passes were given out though! Instead of punching her four times in the face, throwing her on the ground twice, and kicking here while she is down, why not just tackle her, cuff her, and throw her in the drunk tank?","label":0}
{"text":"There are very few industries so completely filled with ultra  thirsty men with no spines to speak of besides the video game industry.  It's one of the main reasons why feminists attack it so openly, the people *in* the industry will almost never fight back, it's only the gamers themselves who bother to tell idiot feminists to take their professional victimhood and shove it up their twats.  She doesn't act like this because she doesn't understand that she'll get away with it whether she's in the wrong or not, because it's \"sexist\" to hold women accountable for the things they do and say.","label":1}
{"text":"You want to play this game with me?   Let's talk about how long you've had bad governorship. There was the retarded aristocrat who lied about his service. Followed by the guy who stepped down rather than be impeached for severe campaign espionage.   Then there was the sex offender who insisted on being interviewed while taking a dump. The dipshit who was elected based on his fun, alcoholic hllbilly brother who pissed on runways and shit.   Then you really went for it. You elected an actor who's greatest accomplishment was authorizing the national guard to shoot protesting hippies. Then some random retard, but you were'n't done there.   Your next sex-offender of a president, who'd raped multiple women decided to personally preside over the execution of a literal retard to hype his \"tough-on-crime\" stance to the whites while playing the sax on Arsenio to appeal to the blacks. He got his dick sucked by interns in the Oval office.   Then you went with George Bush's monkey son, who also kicked off his campaign by presiding over the execution of a retard. He started expensive wars for no reason, without ever actually punishing Saudi Arabia for 9\/   So then you went with hope and change. The black President. Who pretended to be about peace then bombed the shit out of everybody and introduced drones into war (what's the civilian casualty rate on those again.)   Fuck, you wouldn't even be deploying cancer rays at the border if your retard of a president hadn't fucked up Honduras in the first place for no goddamn reason.   Way to invent \"non-lethal\" crowd-dispersing technology that involves microwaving people by the way. Really cool of you.   Don't think that just because you elected one decent president that we don't remember the rest of the dickheads you elected.   Your track record is shit.","label":1}
{"text":"You know what annoys me about this. It's not the weird \"not oppressed enough\" vibe, it's that their argument doesn't actually make sense.  So they start with a number of LGBT individuals saying how they're \"just like you\". They also have a bunch of other unrelated traits that SJWs don't like, just to make sure that you know to hate them.  Then they present a bunch of supposed counter-examples to the idea that pushing \"we're just like you\" is bad, but their counter-examples are nonsensical.   A woman complaining that she accused of having kids for welfare. I assume because she's black. I was under the impression that the 'B' in LGBT stood for 'bisexual', not 'black', shows what I know!  A woman complaining about being harassed and arrested on the suspicion of being a sex worker. It's not clear why from the avatar though, but I'm guessing she's supposed to be South-East Asian? Either way, I'm not sure what the point is. Racism is bad, but what does that have to do with LGBT people?  Homeless woman(?) complains that their sexuality bars them from shelters. Giving them the benefit of the doubt that this is a real problem, it is actually relevant. What I'm failing to see is how that demonstrates a problem with \"just like you\" messaging. Surely if the people running these shelters understood that being gay wasn't really a big deal, they'd let this person in. Also this homeless woman has autism, that isn't actually relevant, but they pretend it is.  Immigrant from ???, at least that's what I assume. Ignoring the weird \"gender variant culture\" stuff, I'm not really sure what the issue is here, again. Colonialism was bad. Racism against immigrants is also bad. How is this an LGBT issue?  Victim of the War on Drugs. I'm guessing orphaned after the Houston Heroin Bombings of  Seriously though, the war of drugs is bad and has had a lot of collateral damage. Again, how is this an LGBT issue?  Wheelchair user complaining about the world being inaccessible to them. Fair enough, I guess. I'm not physically disabled, so I don't know how bad it is for them, but it doesn't matter because it's *not an LGBT issue*.  So 6 examples and only one is clearly relevant (and even then includes some irrelevant stuff). None actually demonstrate the problem with \"we're just like you\" messaging though. Racism is bad, sexism is bad, ableism is bad, but none of those are problems that are relevant for the LGBT community.","label":0}
{"text":"Because the media doesn’t care about the life a minority baby.","label":0}
{"text":"Say what it is. It was a fucking hate crime. They all got off light.","label":0}
{"text":"Wasn’t the male birth control only begging human testing when that story dropped? Wouldn’t that mean it hasn’t even reached the point to be considered for approval?","label":0}
{"text":"Maybe that meeting they had back when everyone thought mittens was getting a cabinet position was actually about the Senate seat.","label":0}
{"text":"Speak for yourself! There's nothing better than new divorcee MILF sex. All the lack of sex, love and pent up anger make for some awesome sex.","label":0}
{"text":"\"La Chancla\"","label":0}
{"text":"The irony of this comment coming from someone defending modern feminism is both hilarious and terrifying.","label":0}
{"text":"Ahh irony is my favorite type of humor.","label":0}
{"text":"Not having 100% say over my body and my children's bodies     Also deregulating healthcare would allow it to be a competitive free market, with all the innovation of a free market and none of this horse shit we deal with atm, because it is horrible as it currently stands.","label":0}
{"text":"you forgot infantalizing of the alpha male, heck all males...","label":0}
{"text":"The bottom line is she can't shirk those debts. Because their court-ordered she'll have to pay them even if it's a couple hundred dollars a month she'll pay the rest of her life.","label":0}
{"text":"Just call them Incel. It is the new N word for white men, and it's so offensive it's like the N word and the C word had a baby.   And just like the N word or the C word, you can attribute any and all of your sexist, racist ideologies to this derogatory term. Only with zero repercussions, since white males are not considered humans anymore.","label":0}
{"text":"Homeless doesn't equal helpless.   I'd say the majority of homeless people probably have mental issues","label":0}
{"text":"So you're stroking your own dick over the distinction between descriptive\/prescription just for my benefit? Thanks sweetheart.","label":0}
{"text":"Name checks out.","label":0}
{"text":"Yeah, as a matter of fact I can because I have. My grandfather was a plumber and I went on plenty of jobs with him as an assistant, not to mention having done it for myself at home. But this is besides the point being the why of it.  So you think it's because of the way we're raised huh. Okay. Let's go with it. Why aren't there any adult women pioneering changes to the way we raise our girls to grow up and collect trash? To work on construction? Etc etc. Why are they instead focusing only on STEM fields and nothing else?  Face it, they're happy to let men take these shitty jobs. The same way we're happy to let illegal aliens work the even nastier, cheaper paying jobs. And that's all it comes down to.","label":0}
{"text":"\\crowdsourced  No way. It has a priestly class that would make the Church envious, and relies on converts to force adherence from the top.  The author is making the exact mistake they want him to make; he's assuming that an organization is *organic*, that it arises naturally, because it's *adoptive*, that it has non-hereditary membership.  They're *not* the same thing.","label":0}
{"text":"What a well articulated argument.   Interestingly enough meat doesn’t have a particularly strong flavor given that most meat based dishes are heavily seasoned with plants. But it’s not like I don’t appreciate that meat can be tasty.   How could you not care about your health, risk of disease, or the health of our planet and the impact that global climate change will have on you and your posterity? It seems short sighted at best.   It’s fine if you don’t want to have a fact based conversation about it, but unfortunately the levels at which Americans consume meat and our processes by which we raise that meat is having a massively detrimental effect on the health of or population and the health of our planet. That’s not an opinion.   You can chose to ignore it and only retort with insights about how much you like the taste of meat, but the facts remain, that you’re selfishly choosing taste and self gratification over what’s best for you, the planet, animals, and your posterity. You’re better than that. We can’t eat candy every meal. And we can’t eat meat every meal.","label":0}
{"text":"lmao well yeah that pm makes him a cunt but at first it really sounded like a suggestion. Some people are so fixed on having a kid they never truly consider adoption when there are plenty of kids out there looking for stable homes.","label":0}
{"text":"No!","label":0}
{"text":"I support this  Most people who support this are pedophiles  🤔🤔🤔  Are you sure?","label":0}
{"text":"thats a retarded and facile stance","label":1}
{"text":"I think it’s hysterical that’s their go to buzzword.  “Omg you guys are all just virgins”.....!","label":0}
{"text":"sometimes I just cant express how much I just don't care what these vapid dottering twats are complaining about.  &#x200B;  I don't care if you feel underrepresented.  &#x200B;  I don't care if you want big name companies to pander to you.  &#x200B;  and most importantly I don't care about your cause that you are fighting for. in your over privileged first world country life style.  &#x200B;  while people in Africa are starving. and people in the middle east are being killed indiscriminately by dictators, while there is even any kid anywhere having to go to bed with an empty stomach.  &#x200B;  I cant say it enough. I just don't care about these irrelevant problems or how hurt your feelings are.","label":1}
{"text":"Even if it did.. he's still strange and abnormal.  People act like it's a fucking insult to be \"abnormal\" or \"not normal\".  We're all normal and abnormal in our own ways. Society, or groups, have nominatives.    And it's always amazing to me that those obsessed with their snowflake status, have such a love\/hate relationship with pointing out that they are indeed..snowflakes.  If something makes you unique... or not the norm, how do you embrace it on one hand and then get furious when it's pointed out on the other.","label":0}
{"text":"The Father would end up in butt fuck prison for life, if he tried to pull that stunt.","label":0}
{"text":"\"I don't think he's a comedian\"\"I don't believe it was a joke\"  She's the interviewer.  No one cares what she thinks.","label":0}
{"text":"I guess I'm a centrist on this, unwashed goat fuckers bring the disease back in, where it can infect children of retarded ass shit brains who think vaccines cause autism.  The fact that the same parents who think vaccines cause autism are often found screaming for open borders is simply the icing on the cake.","label":1}
{"text":"It's Riot Games.  As in \"We will ban everyone who calls other player \"retard\" but won't do anything about actual retards or trolls playing, also we will let our staff wishing players death of cancer as long as it doesn't get public\".","label":1}
{"text":"I don't understand why people complain about this, the relationship between Uber and their drivers is purely consentual and open, how is that not fair?","label":0}
{"text":"You have a fucking anime reference as your name, you shouldn't be asking that question to fucking anyone","label":0}
{"text":"It's an offshoot of chad memes.  They're funny.  Feel free to laugh.  Unless you live in a SOCIETY!","label":0}
{"text":"Woah there FreshNothingBurger! Next time, please refrain from using this horribly bigoted term. Instead, please use the universally accepted \"3\/5ths American\".  Thank you for your understanding.  *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/ImGoingToHellForThis) if you have any questions or concerns.*","label":0}
{"text":"And yet they call US the sexists.","label":0}
{"text":"As even Richard Spencer said, SJWs are the reason the Alt-Right exists.","label":0}
{"text":"Even though it's not the main point, it's pretty retarded to not allow sleeveless shirts in a gym. Might as well declare that you must wear jeans, and you're not allowed to break a sweat either.","label":1}
{"text":"It was probably people who were going to vote for the democrats so count your blessing.","label":0}
{"text":"Youre such a loser. You just cant manage to be with one or youre a faggot \/s  People are funny tho. Once shaming doesnt work anymore you can see just how much people do use shaming and its hilarious to me.  Thats all the power they have on you, which you give them","label":1}
{"text":"I work and it fucking sucks. bosses are fucking baby boomers that have no sense of rationale or even enough IQ points to lead anyone. Stay strong boys, do what ever the fuck you want. These people are proud to work 50-60-70 hour weeks and think they are special. fucking retards dont even have a clue.","label":1}
{"text":"She's offering to pay him less than minimum wage for his labor and equipment and she's calling him the cheap ass?   What a cunt.","label":1}
{"text":"😢🥛   Sounds like you’re still crying into your soy milk! Hilarious! 🤣  How long can one purple-haired SJW stay triggered anyway? 😂","label":0}
{"text":"I'm just amazed that someone can be THAT goddamn angry at the world.","label":0}
{"text":"You have to listen to me! But you don’t have to listen to people who claim they’re innocent when spuriously accused of rape, just lock them up!","label":0}
{"text":"Then I don't get what you are arguing. Are you saying putting shit on the seat next to you is a female exclusive problem? Frankly I've seen more men do that too. Inconsiderate behavior is inconsiderate behavior. Male or female. So I don't get the point of this post on a mens rights thread","label":0}
{"text":"Lol! Nah, just hate people who don't understand basic biology. I want to be a spoon, can I magically change that? Just such a stupid mentality.","label":0}
{"text":"This is the next generation of satire, and you won't even know it. \/hypothesis","label":0}
{"text":"And just what has your laughable philo-semitism accomplished? They still call you a Nazi.","label":0}
{"text":"You’re retarded don’t @ me","label":1}
{"text":"Okay, Kathy Newman   So What you're REALLY saying is...  I'm going to be DEVASTATED when I discover JBP isn't Christ reincarnated. You mean... He's just a human? A White Male even? ... You're saying...  He Might get something wrong and because of that he can't be trusted - in fact he should be killed. Because the CBC told me he is a racist nazi bigot jew lover who wouldn't let the transpipo in his class even LIVE or EXIST...  *face palm*  Thanks for saving me","label":1}
{"text":"All of that just so people look at her and give her attention. Jesus Christ. I love the thought of it coming home as much as the next Brit, but that doesn’t mean you get to act like a cunt. Have some class.","label":1}
{"text":"I understand your a troll but wouldn’t it be easier on a Russian subreddit","label":0}
{"text":"Yeah, I don't get why it's alright for white people to learn a European language suck as Italian, but not for them to learn primarily minority spoken languages. But, it's ok for minorities to speak a European language, e.g. in my Italian class, there's about an even amount of whites  to minorities, double standards.","label":0}
{"text":"tenant   a tenant leases space, a tenet is an ideological principle.  Just trying to help polish an otherwise great comment.","label":0}
{"text":"Firewatch is absolute fucking TRASH. Its a story driven game, meaning you do absolutely nothing other than walk around and dialogue. Which im fine with if the story is good. Firewatch's story unfortunately is total shit. With multiple m night shamylan twist that all amount to nothing and were just thrown in to hide how bland and shit the narrarive is. The end is horribly written amd makes no sense from how the characters act the whole rest of the game. And its 5 hours long. Probably my most hated game.","label":0}
{"text":"I also found being picked on to be highly motivating. My group of friends, we all chirp each other, its a great way to keep in check, and laugh at ourselfs.","label":0}
{"text":"Well it depends on the relative quantity of the oppressors\/oppressed, and the form of the racism\/abuse.  From a purely utilitarian standpoint it isn't hard to fabricate (or even find in history) examples where it's very likely that the minor gains in happiness of the many outweigh the horrendous suffering of the few.  A googol people having a speck of dust in their eye would be, under many interpretations of utilitarianism, worse than a single person getting tortured after all.  edit: And to come back to reality, the question of stopping racism isn't as simple as flipping a boolean of thinking racism is good\/bad, most people you find arguing against current measures supposedly against racism (or its impacts). like affirmative action. will not argue that racism is a good thing, but that those measures don't actually stop racism (or its impacts).","label":0}
{"text":"Yeah see I don't really like to be a grammar nazi kind of guy (unless I'm really drunk and being an asshole), but when you spell \"principal\" as \"principle\" in *your specific sentence here*, it can really throw off a random non-sober reader.","label":0}
{"text":"Preventing a murder via self defense is solid. We can donate to defend people that legitimately kill a cop in self defense?","label":0}
{"text":"Can’t remember who but a comedian(it was a black comedian and I think it was Hannibal Burress, but not certain) always said he absolutely hated it when he heard people say “the n-word” because all it did was allow the typical white newscaster(as he put it in the premise) to say it without actually saying it and still put the exact same meaning and thought into his head.","label":0}
{"text":"The crazy thing is, during their leadership campaign, the Liberals actually had a candidate with substance, new ideas and a great track record in Mark Garneau.  It was the first time in decades that a candidate like that had presented themselves but the core driving philosophy of Liberals (and liberals) is obtaining power so Jr, who didn't even bother with policy during the leadership campaign, won in a landslide.","label":0}
{"text":"Trust his plan.","label":0}
{"text":"What? So many people should have their heads kicked in. Sensative princesses everywhere these days.","label":0}
{"text":"I’m sure that’ll help the conviction for both move along smoothly.","label":0}
{"text":"Just goes to show how these bitches have NO fucking integrity   found the incel. I knew they had to go somewhere.","label":0}
{"text":"We are growing up. That's why conservatism is seeing a rise in the world despite media saying differently and branding it as some alt-right fascist rise.  edit: they did so under duress. It's not real. It was social pressure that forced european societies to open their borders.","label":0}
{"text":"This is actually really dumb because for an undeveloped country having kids is probably the best thing you can do. The more survive the more basically free labor you have.   This would be equivalent to saying every single major country went through a time of retardation where they had kids even though they couldn't afford them.","label":1}
{"text":"so the dad isn't perfect but look how terrified this kid is to live with his mom. Living hell, most likely. I would feel physically ill if I had to hand this kid over to that lady, this is awful. He's clearly much happier living with his dad","label":0}
{"text":"Exactly. They are definitely Latinos...but I doubt they speak much Spanish. Being bilingual is way too high class for them.","label":0}
{"text":"You're only making yourself look bad.","label":0}
{"text":"The guy who brought up BP said the first stupid thing. It was monumentally ignorant. Stop being such a crybaby snowflake.","label":0}
{"text":"I predicted there would be actual justice in this case.  My prediction has very little to do with legal insights or specifics of this case, though those strongly favor the victim.    It has to do with the fact we've now arrived at peak moral panic.  You can thank those who believed it was a good idea to persecute Kavanaugh on a strategy of moral panic outrage rather than on a strategy of criticizing his objective record (one, which, had they honestly pursued, they may well have won, to be honest).  This is how pretty much all moral panics eventually die.  They go too far, hit a point of ludicrousness that is obvious to everyone who's willing to be honest (even if they will not freely admit it to others), and then evaporate somewhat quickly.  We're now in the evaporation phase.  PoundMeToo has very little real power anymore, as a result.  Simply ignoring them is now a viable defense for many of the accused.","label":0}
{"text":"This post made by the 2 genders gang.","label":0}
{"text":"No mate:  The OP is \/u\/cabbagetwat   The Author is the person who wrote the thing that the OP posted for us to react to.  It does get confusing though, given that we effectively have two different 'posters' and need to differentiate between them.  edit typo","label":0}
{"text":"It's not even just this once instance...  she's always irritating. The other day the teacher mentioned the words ''sugar daddy'' as an example to some business concept (where the person doesn't do anything but still has power in the company) and she was the **only** girl in that class who giggled. Loudly.  She tries to be that cute, funny, popular girl but falls flat on her face. Very superficial.  I remember at the very start, I saw her at the train station I go to after school. So I talked to her a few times. Eventually, I decided to walk with her since we had our last class together that day. She began pulling her headphones out of her pocked and untangling them. I thought it was a bit odd, but whatever. She plugs them into her ears, starts making a call as she's walking with me, without saying anything. I thought okay, maybe it won't last long. Oh, how wrong I was.   She just kept talking and talking. Eventually walking faster and faster, and went to a different part of the station. Haven't talked to the bitch since, nor do I ever intend to, again.","label":0}
{"text":"No you don't but it sure makes you look like a massive pussy if your answer to a little snap is knocking them out.  Your comment just reeks of incel","label":1}
{"text":"I'm assuming it was the one I'd responded to that was deleted. If that wasn't you, my bad. I implore you to continue to take up their cause if it really wasn't you, though. I've got another 25-30 minutes to kill and you respond quite favorably to my trolling...  ...you stupid cunt.","label":1}
{"text":"Then maybe she should have the current card.","label":0}
{"text":"the left can’t meme  That the right wants to replace actual discourse with memes is exactly the stereotype the left has of the right.","label":0}
{"text":"Nope. FL was likely barely saved last night.","label":0}
{"text":"We're all Ken M on this blessed day.  ^^Or ^^however ^^that ^^goes","label":0}
{"text":"Canada, Canada, Canada, Canada and Canada because they don't deserve to be beside America","label":0}
{"text":"Because anxiety disorders and not being able to hold your anger are apparently debilitating mental health problems.  I bet if I went out and punched a cop my lawyer would tell me to plead insanity because I have schizoaffective disorder but theres not a doubt in my mind I would be ruled competant- because I think everybody hates me, I'm delusional not retarded.  Mental health problems or not, you are responsible for your actions unless you are so incompetant you need to be institutionalized.","label":0}
{"text":"evil cunt","label":1}
{"text":"Not for PUBLIC consumption. Sorry","label":0}
{"text":"Yup. But you are deluded in thinking you speak for everyone.      Actually as I look at your posts I get the feeling that you are a black propaganda op.      But that would overlooking a lot of skepticism; your posts are seething with self hate.","label":0}
{"text":"Uh, no, it's called being charitable.","label":0}
{"text":"You dumb cunts.  Have such rote responses?  FTFY.","label":1}
{"text":"Oh baby! Toss me in the back of a van and make the suspension snap.","label":0}
{"text":"They have no other relevant force multipliers that we can see and in fact are likely on the wrong side of twitter’s suppression algorithms. If anything, we can probably assume the average “influence coefficients” of these Russian bots to be smaller than that of the average human twitter user.  Point being: you are singling out specific premises for your absurdly reductive argument when there is clearly plenty more to reason with. It’s disingenuous or autistic, and it’s obnoxious and pointless either way.","label":0}
{"text":"If I ask someone on a date, I expect to be paying for them.  I don't limit what they're ordering.  That's just being cheap.  If you can't afford to pay for a nice meal, including a drink, then don't ask them out or don't take them somewhere you can't afford. That being said, don't be a cunt and order the most expensive things on the menu.  If you're being treated to a meal, order like you would if you were paying, ya triflin bitch. That applies to both men and women both for doing the asking and being asked.","label":1}
{"text":"Because you sound like an idiot, that's all. But to each their own. Good luck. Just my opinion. Etc.","label":0}
{"text":"The media will cover for the Dems and call republicans conspiracy theorists, sire losers, etc.","label":0}
{"text":"If I'm reading this right, I don't think this is one of those things. This sounds suspiciously like they simply didn't know the first thing about making an online game and really did just mod an online mode into the existing game with *zero forethought*.   *Let it break in Beta so it'll be fixed at release* is fine when it's small things and holes in your security. This is beyond that *if true* to the point where there basically *is no security at all*.   I'm actually struggling to believe this *is* true, because it'd be an act of incompetence so staggering that even a cold hearted cynic like me is struggling to believe they could be that bad.","label":0}
{"text":"Imagine being so self centered you think men are literally grinding their teeth down in seething anger that they cant talk to you.","label":0}
{"text":"It's obviously been pre established that they're going to throw down, but hey, he should just give her a free swing, right?   Where do you live, bro? I wanna come to your house and stand in your face with my fists squared.  And if you try to swing at me first, you're a raging asshole, k?","label":0}
{"text":"As a Latina the term “latinx” is so irritating it’s so dumb. We’re not gonna change the whole language just to prove how woke we are.","label":0}
{"text":"I dunno.  I mean I'm Celt and Danish, born\/live in Canada and speak English and French.  I'm not even sure what language I should be speaking now.  I'm just all around offensive.  I ain't no Jute tho, you stay off my island ya north-german :P","label":0}
{"text":"\"Watching porn is like borderline cuckoldry\". This is one of the most retarded sentence i've ever read.","label":1}
{"text":"Why the fuck would you wear that shit at any event outside of some kind of sex party?  Jesus Christ.","label":0}
{"text":"The guy said he thought it was just a friend joking around. If he had resisted, it would have been much more difficult. I kind of feel she still would have been successful though I wouldn't bet my life savings on it. It was the element of surprise she had is probably the main factor. I'm not saying she's an all dominating bastion of strength, just that it was brave of her to confront what she thought was her attacker, and impressive how competent she was at doing it.  He would have been justified in defending himself for sure, and yeah you get white knights like that sometimes, but it's certainly not a given. A lot of people are more intelligent and do just try to separate and don't assume the male is the aggressor.","label":0}
{"text":"Vice is routinely tongue in cheek especially in the headlines.  And I don't think they would be empathetic about upsetting literal-minded MRAs.","label":0}
{"text":"Yep, the hypocrisy permeates all of their \"arguments\".  Anyway, women get handed dildos at universities??","label":0}
{"text":"If anything, russian bot accounts would have a *harder* time shaping a narrative than those who have the blue check mark. So what's your point?","label":0}
{"text":"This was posted not so long ago. Im sure I  remember people being worried for her welfare as the video showed the man was being very controlling. It's possible she was being encouraged to do these things for followers and views online and the guys were probs making a shit ton of money off her. It seems odd she would agree to do this knowing she would fail.","label":0}
{"text":"Don't know if it's just me.. all feminists look the same to me. Like untextured polygons.","label":1}
{"text":"How do we know she never paid taxs ? Considering there are taxs on a lot of things I find this post retarded","label":1}
{"text":"20-30 especially if she went straight to college after high school, low end if from a smaller town. That's what I've been told by former gfs anyway.","label":0}
{"text":"You are supporting the wrong side, he swung first.","label":0}
{"text":"He really seemed better at the time than what he turned out to be. Sort of like Obama.    He did have 10 years of training at the hands of the finest Liberals, he seemed to be really competent in the debates and legalizing weed was something the country had been screaming for since the days of Chretien.    We were fooled of course, but don't let the polling numbers convince you that the country isn't outraged by his behaviour as Scheer and Singh are a bad joke at best.    As for Red Green, that great Canadian seems to be spending his retirement uploading clips to youtube with his commentary so I have no complaints there.    As for the CBC, if we burn their building down they'll just build another one with our tax dollars, 100 times as expensive as the current building.    We're smart in our own way. Don't get fooled by the current state of our politics. Just remember my (what-I'm-assuming is) my American friend, Trudeau is our Obama and Obama won a second term solely because he was running against a McCain-Palin ticket. Your last election could have easily been Hillary vs. Jeb if things had worked out the way that your foreign influences would have wanted. We'll figure this out.    Our next great leader has already broken free and has started his own political party that will return our country to greatness. We just run 7 years behind you.","label":0}
{"text":"Without predators, the Human is becoming more and more retarded until, one day we will hit the critucal point.","label":1}